; ==================================================================================================
; Title:      OA_Tools_DE.lng
; Author:     G. Friedrich
; Version:    C.1.0
; Purpose:    ObjAsm OAT_App german language resource file.
; Notes:      Version C.1.0, October 2017
;               - First release.
; ==================================================================================================


STRINGTABLE
LANGUAGE LANG_GERMAN, SUBLANG_GERMAN
BEGIN
  IDLANG_GERMAN  + IDS_APPLICATION,             "&Anwendung|Anwendungsbefehle"
  IDLANG_GERMAN  + IDS_APPL_SETUP,              "&Einstellungen...~F2|Anwendungeinstellungen"
  IDLANG_GERMAN  + IDS_LANGUAGE,                "&Sprache|Sprachauswahl"
  IDLANG_GERMAN  + IDS_LANG_ENGLISH,            "&English|English language"
  IDLANG_GERMAN  + IDS_LANG_GERMAN,             "&Deutsch|Deutsche Sprache"
  IDLANG_GERMAN  + IDS_LANG_SPANISH,            "&Español|Lenguage español"
  IDLANG_GERMAN  + IDS_LANG_CHINESE,            "中文|中文"
  IDLANG_GERMAN  + IDS_APPL_EXIT,               "B&eenden...~Alt+F4|Beendet die Anwendung"

  IDLANG_GERMAN  + IDS_EDIT,                    "&Editieren|Editierbefehle"
  IDLANG_GERMAN  + IDS_EDIT_CUT,                XMENU_CAT_RES(Au&sschneiden~Ctrl+X, IDS_HINT_CUT)
  IDLANG_GERMAN  + IDS_EDIT_COPY,               XMENU_CAT_RES(&Kopieren~Ctrl+C, IDS_HINT_COPY)
  IDLANG_GERMAN  + IDS_EDIT_PASTE,              XMENU_CAT_RES(&Einfügen~Ctrl+V, IDS_HINT_PASTE)
  IDLANG_GERMAN  + IDS_EDIT_DELETE,             XMENU_CAT_RES(&Löschen~Del, IDS_HINT_DELETE)
  IDLANG_GERMAN  + IDS_EDIT_SELECT_ALL,         XMENU_CAT_RES(&Alles selektieren~Ctrl+A, IDS_HINT_SELECT_ALL)

  IDLANG_GERMAN  + IDS_OPEN_EDITOR,             XMENU_CAT_RES(E&xternen Editor öffnen, IDS_HINT_OPEN_EDITOR)
  IDLANG_GERMAN  + IDS_COPY_FILENAME,           XMENU_CAT_RES(&Dateinamen kopieren, IDS_HINT_COPY_FILENAME)
  IDLANG_GERMAN  + IDS_CHECK_AGAIN,             XMENU_CAT_RES(Erneut &prüfen, IDS_HINT_CHECK_AGAIN)

  IDLANG_GERMAN  + IDS_MENU_CHECK,              "&Prüfungen|Prüfungen des Source-Code"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MTD,          "Methode"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MTD_REG,      "&Register...|Verwendungsprüfung von Registern innerhalb einer Methode"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MTD_ARG,      "&Argument...|Verwendungsprüfung von Methodenargumenten"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MTD_LOC,      "&Local...|Verwendungsprüfung von lokalen Variablen"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MTD_ALL,      "&Alle...~F5|Ausführen aller Methodenprüfungen"
  IDLANG_GERMAN  + IDS_MENU_CHECK_PRC,          "Prozedur"
  IDLANG_GERMAN  + IDS_MENU_CHECK_PRC_REG,      "R&egister...|Verwendungsprüfung von Registern innerhalb einer Prozedur"
  IDLANG_GERMAN  + IDS_MENU_CHECK_PRC_ARG,      "Ar&gumente...|Verwendungsprüfung von Prozedurargumenten"
  IDLANG_GERMAN  + IDS_MENU_CHECK_PRC_LOC,      "L&ocals...|Verwendungsprüfung von lokalen Prozedurvariablen"
  IDLANG_GERMAN  + IDS_MENU_CHECK_PRC_ALL,      "A&lle...~Strg+F5|Ausführung aller Prozedurprüfungen"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MAC,          "Macro"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MAC_ARG,      "Argu&mente...|Verwendungsprüfung von Macro-Argumenten"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MAC_LOC,      "Lo&cals...|Verwendungsprüfung von lokalen Macro-Variablen"
  IDLANG_GERMAN  + IDS_MENU_CHECK_MAC_ALL,      "All&e...~Alt+F5|Ausführung aller Macro-Prüfungen"

  IDLANG_GERMAN  + IDS_TOOL,                    "&Werkzeuge|Externe nützliche Werkzeuge"

  IDLANG_GERMAN  + IDS_WINDOW,                  "&Fenster|Fenterbefehle"
  IDLANG_GERMAN  + IDS_WINDOW_CASCADE,          XMENU_CAT_RES(&Überlappend~Shift+F5, IDS_HINT_CASCADE)
  IDLANG_GERMAN  + IDS_WINDOW_TILE_HOR,         XMENU_CAT_RES(&Nebeneinander, IDS_HINT_TILE_HOR)
  IDLANG_GERMAN  + IDS_WINDOW_TILE_VER,         XMENU_CAT_RES(&Untereinender~Shift+F4, IDS_HINT_TILE_VER)
  IDLANG_GERMAN  + IDS_WINDOW_ARRANGE,          XMENU_CAT_RES(&Symbole anordnen, IDS_HINT_ARRANGE)
  IDLANG_GERMAN  + IDS_WINDOW_NEXT,             XMENU_CAT_RES(&Nächstes Fenster~Ctrl+F6, IDS_HINT_NEXT)
  IDLANG_GERMAN  + IDS_WINDOW_PREV,             XMENU_CAT_RES(&Vorhergehendes Fenster~Ctrl+Shift+F6, IDS_HINT_PREV)
  IDLANG_GERMAN  + IDS_WINDOW_CLOSE,            XMENU_CAT_RES(S&chliesst das aktive Fenster~Ctrl+F4, IDS_HINT_CLOSE)
  IDLANG_GERMAN  + IDS_WINDOW_CLOSE_ALL,        XMENU_CAT_RES(Schliesst &alle Fenster, IDS_HINT_CLOSE)

  IDLANG_GERMAN  + IDS_HELP,                    "&Hilfe|Hilfesystem"
  IDLANG_GERMAN  + IDS_HELP_SYSINFO,            "&Systeminformation...|Anzeigen der Systeminformation"
  IDLANG_GERMAN  + IDS_HELP_HELP,               "&Hilfe...~F1|Anzeigen der Anwendunghilfe"
  IDLANG_GERMAN  + IDS_HELP_ABOUT,              "&Ueber...~Shift+F1|Anzeigen von Anwendungsinformation"

  IDLANG_GERMAN  + IDS_HINT_CUT,                "Auswahl ausschneiden und ablegen in die Zwischenablage"
  IDLANG_GERMAN  + IDS_HINT_COPY,               "Kopieren der Auswahl und ablegen in die Zwischenablage"
  IDLANG_GERMAN  + IDS_HINT_PASTE,              "Kopieren aus der Zwischenablage"
  IDLANG_GERMAN  + IDS_HINT_DELETE,             "Löschen der Auswahl"
  IDLANG_GERMAN  + IDS_HINT_SELECT_ALL,         "Selektieren des gesamten Inhaltes"

  IDLANG_GERMAN  + IDS_HINT_CASCADE,            "Alle Fenster überlappend anordnen"
  IDLANG_GERMAN  + IDS_HINT_TILE_HOR,           "Alle Fenster nebeneinander anordnen"
  IDLANG_GERMAN  + IDS_HINT_TILE_VER,           "Alle Fenster untereinander anordnen"
  IDLANG_GERMAN  + IDS_HINT_ARRANGE,            "Alle Symbole untereinander anordnen"
  IDLANG_GERMAN  + IDS_HINT_NEXT,               "Fokus auf das nächte Fenster richten"
  IDLANG_GERMAN  + IDS_HINT_PREV,               "Fokus auf das vorherige Fenster richten"
  IDLANG_GERMAN  + IDS_HINT_CLOSE,              "Das aktive Fenster schliessen"
  IDLANG_GERMAN  + IDS_HINT_CLOSE_ALL,          "Alle Fenster schliessen"

  IDLANG_GERMAN  + IDS_HINT_OPEN_EDITOR,        "Den externen Editor aufrufen"
  IDLANG_GERMAN  + IDS_HINT_COPY_FILENAME,      "Dateinamen in die Zwischenablage kopieren"
  IDLANG_GERMAN  + IDS_HINT_CHECK_AGAIN,        "Prüfungen erneut durchführen"

  IDLANG_GERMAN  + IDS_HINT_ZOOM_IN,            "Heranzoomen"
  IDLANG_GERMAN  + IDS_HINT_ZOOM_OUT,           "Wegzoomen"

  IDLANG_GERMAN  + IDS_WORKING,                 "Am arbeiten"
  IDLANG_GERMAN  + IDS_CHECK_REG_READY,         "Verwendungsprüfung von Registern abgeschlossen."
  IDLANG_GERMAN  + IDS_CHECK_LOC_READY,         "Verwendungsprüfung von lokalen Variablen abgeschlossen."
  IDLANG_GERMAN  + IDS_CHECK_ARG_READY,         "Verwendungsprüfung von Argumenten abgeschlossen."
  IDLANG_GERMAN  + IDS_FILE_EMPTY,              "Diese Datei is leer!"
  IDLANG_GERMAN  + IDS_FILE_OPEN_ERROR,         "Diese Datei kann nicht geöffnet werden!"

  IDLANG_GERMAN  + IDS_SELECT_FILE,             "Wählen sie eine Datei..."
  IDLANG_GERMAN  + IDS_SELECT_EDITOR,           "Wählen sie einen externen Editor..."
  IDLANG_GERMAN  + IDS_SELECT_TOOL,             "Wählen sie ein Werkzeug..."
  IDLANG_GERMAN  + IDS_INTERNAL_FAILURE,        "Interner Anwendungsfehler!"

  IDLANG_GERMAN  + IDS_DLG_EXIT_CAPTION,        "ObjAsm Tools schliessen"
  IDLANG_GERMAN  + IDS_DLG_EXIT_QUESTION,       "Sind Sie sicher, dass Sie die Anwendung schliessen möchten?"
  IDLANG_GERMAN  + IDS_DLG_EXIT_YES,            "&Ja"
  IDLANG_GERMAN  + IDS_DLG_EXIT_NO,             "&Nein"

  IDLANG_GERMAN  + IDS_TAB1_MAIN,               "&Allgemein   "
  IDLANG_GERMAN  + IDS_TAB1_APPLICATION,        "Anwendung"
  IDLANG_GERMAN  + IDS_TAB1_EXTERNAL_EDITOR,    "&Externer Editor:"
  IDLANG_GERMAN  + IDS_TAB1_LINE_TERMINATOR,    "Zeilenende:"
  IDLANG_GERMAN  + IDS_TAB1_WINDOW,             "Fenster"
  IDLANG_GERMAN  + IDS_TAB1_ZOOM_FACTOR,        "&Zoomfaktor:"
  IDLANG_GERMAN  + IDS_TAB1_FONTFACE_NAME,      "Schrift&name:"
  IDLANG_GERMAN  + IDS_TAB1_FONT_SIZE,          "Schrift&grösse:"
  IDLANG_GERMAN  + IDS_TAB1_CHECKS,             "Prüfungen"
  IDLANG_GERMAN  + IDS_TAB1_CLOSE_NO_FINDINGS,  "&Schliessen wenn kein Befund"
  IDLANG_GERMAN  + IDS_TAB1_USE_ANNOTATIONS,    "&Verwende -annotations-"
  IDLANG_GERMAN  + IDS_TAB1_MIXED,              "&Beide"

  IDLANG_GERMAN  + IDS_TAB2_TOOLS,              "&Werkzeuge   "
  IDLANG_GERMAN  + IDS_TAB2_TOOL,               "Wkz."
  IDLANG_GERMAN  + IDS_TAB2_NAME,               "Name"
  IDLANG_GERMAN  + IDS_TAB2_COMMAND,            "Befehl"
  IDLANG_GERMAN  + IDS_TAB2_NOTE,               "Notiz: '$' dem Befehl anhängen um den Dateinamen beigegeben."

  IDLANG_GERMAN  + IDS_TAB3_COLORS,             "&Farben  "
  IDLANG_GERMAN  + IDS_TAB3_COLOR_NOTIF,        "&Benachrichtigung"
  IDLANG_GERMAN  + IDS_TAB3_COLOR_COMMENT,      "&Information"
  IDLANG_GERMAN  + IDS_TAB3_COLOR_FAILIURE,     "&Programmfehler"
  IDLANG_GERMAN  + IDS_TAB3_COLOR_BKGROUND,     "&Hintergrund"
  IDLANG_GERMAN  + IDS_TAB3_COLOR_REG_ERROR,    "&Regiserfehler"
  IDLANG_GERMAN  + IDS_TAB3_COLOR_REG_WARNING,  "&Registerwarnung"
  IDLANG_GERMAN  + IDS_TAB3_COLOR_ARG_WARNING,  "&Argumentwarnung"
  IDLANG_GERMAN  + IDS_TAB3_COLOR_LOC_WARNING,  "&Lokalwarnung"
  IDLANG_GERMAN  + IDS_TAB3_NOTE,               "Notiz: Änderungen werden wirksam auf neue Fenster."

  IDLANG_GERMAN  + IDS_SETUP,                   "Einstellungen"
  IDLANG_GERMAN  + IDS_CANCEL,                  "&Abbrechen"

  IDLANG_GERMAN  + IDS_CODEBLOCK_NAME,          "  Code-Block:  "
  IDLANG_GERMAN  + IDS_REGISTERS,               "  Register:   "
  IDLANG_GERMAN  + IDS_ARGUMENTS,               "  Argument(e):"
  IDLANG_GERMAN  + IDS_LOCALS,                  "  Lokal(e):   "
  IDLANG_GERMAN  + IDS_REG_WARNING,             "WARNUNG: möglicherweise unnötige Registererhaltung erkannt."
  IDLANG_GERMAN  + IDS_ARG_WARNING,             "WARNUNG: möglicherweise unbenutzte(s) Argument(e) erkannt."
  IDLANG_GERMAN  + IDS_LOC_WARNING,             "WARNUNG: möglicherweise unbenutzte lokale Variable(n) erkannt."
  IDLANG_GERMAN  + IDS_REG_ERROR,               "FEHLER: möglicherweise nicht erhaltene(r) Register erkannt."

  IDLANG_GERMAN  + IDS_SELECTION_FILE_NAME      "&Ausgewählte Datei:"
  IDLANG_GERMAN  + IDS_SELECTION_OPEN           "Ö&ffnen"
  IDLANG_GERMAN  + IDS_SELECTION_FILTER_NAME_0  "Assemblerdateien"
  IDLANG_GERMAN  + IDS_SELECTION_FILTER_NAME_1  "Textdateien"
  IDLANG_GERMAN  + IDS_SELECTION_FILTER_NAME_2  "Alle Dateien"

  IDLANG_GERMAN  + IDS_ABOUT_CAPTION,           "Über diese Anwendung"
  IDLANG_GERMAN  + IDS_ABOUT_APPLICATION,       "ObjAsm Tools"
  IDLANG_GERMAN  + IDS_ABOUT_VERSION,           "Version "
  IDLANG_GERMAN  + IDS_ABOUT_DESCRIPTION,       "Diese Anwenung ist eine Sammung von Werkzeugen um Assembler-Code zu überprüfen.\nBitte lesen Sie die Bedienungsanleitung sorgfältig durch."
  IDLANG_GERMAN  + IDS_ABOUT_EMAIL,             "ICON_LINK|&Besuchen Sie unsere Homepage|http://objasm.x10host.com/"
  IDLANG_GERMAN  + IDS_ABOUT_HOMEPAGE,          "ICON_MAIL|&Senden Sie uns eine Email|mailto:objasm@gmx.net"

  IDLANG_GERMAN  + IDS_TOOL_FILTER_NAME_0       "Ausfürbare Dateien"
  IDLANG_GERMAN  + IDS_TOOL_FILTER_NAME_1       "Batch Dateien"
  IDLANG_GERMAN  + IDS_TOOL_FILTER_NAME_2       "Script Dateien"
  IDLANG_GERMAN  + IDS_TOOL_FILTER_NAME_3       "Alle Dateien"

  IDLANG_GERMAN  + ID_MDI_MORE,                 "&Weitere Fenster...|Fenster auswählen"
  IDLANG_GERMAN  + ID_MDI_LIST,                 "Fensterliste"

  IDLANG_GERMAN  + IDS_DROP_CHECK_MTD,          "Methodenprüfungen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MTD_REG,      "&Register|Verwendungsprüfung von Registern innerhalb einer Methode"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MTD_ARG,      "&Argument|Verwendungsprüfung von Methodenargumenten"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MTD_LOC,      "&Local|Verwendungsprüfung von lokalen Variablen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MTD_ALL,      "&Alle~F5|Ausführen aller Methodenprüfungen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_PRC,          "Prozedurprüfungen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_PRC_REG,      "R&egister|Verwendungsprüfung von Registern innerhalb einer Prozedur"
  IDLANG_GERMAN  + IDS_DROP_CHECK_PRC_ARG,      "Ar&gumente|Verwendungsprüfung von Prozedurargumenten"
  IDLANG_GERMAN  + IDS_DROP_CHECK_PRC_LOC,      "L&ocals|Verwendungsprüfung von lokalen Prozedurvariablen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_PRC_ALL,      "A&lle|Ausführung aller Prozedurprüfungen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MAC,          "Macroprüfungen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MAC_ARG,      "Argu&mente|Verwendungsprüfung von Macro-Argumenten"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MAC_LOC,      "Lo&cals|Verwendungsprüfung von lokalen Macro-Variablen"
  IDLANG_GERMAN  + IDS_DROP_CHECK_MAC_ALL,      "All&e|Ausführung aller Macro-Prüfungen"
END
